"""
Создайте класс Transaction, который хранит сумму, дату, валюту
(по умолчанию «USD» – доллар США), курс валюты по отношению
к доллару (по умолчанию 1) и описание (по умолчанию None). Все ат>
рибуты данных должны быть частными. Реализуйте следующие
свойства, доступные только для чтения: amount, date, currency,
usd_conversion_rate, description и usd (вычисляется, как amount *
usd_conversion_rate). Реализацию класса можно уместить в шестьде>
сят строк программного кода, включая несколько простейших доктестов.
"""